app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "value", "inventory", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Macarrão"], ["description", "testando"], ["value", "10.0"], ["inventory", 1], ["created_at", "2015-11-26 23:49:08.071140"], ["updated_at", "2015-11-26 23:49:08.071140"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save