app/controllers/sales_controller.rb

  def index
    @sales = Sale.all

    products = ""
    @sales.each { |sale|
      sale.productId.split(",").each { |productId|
        product = Product.find(productId)
---
SELECT "sales".* FROM "sales"
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @sale = Sale.new(sale_params)

    respond_to do |format|
      if @sale.save
---
INSERT INTO "sales" ("cpfSalesman", "cnpjClient", "nameClient", "addressClient", "productId", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def set_sale
      @sale = Sale.find(params[:id])
---
SELECT  "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT 1  [["id", 1]]